[
  {
    "title": "A Comparison of Propaganda Techniques between Orwell's 1984 and The People's Republic of China.",
    "category": "School Work",
    "description": "<p>This was the first website I published for school. I've been messing around with CSS, HTML and Javascript for a good amount of time now, all for fun, as seen by <i>Trapped!</i> below. This website has many faults cross-browser, as I only used IE and Firefox when making the website. Expect bugs and improper styling if not on an old version of IE.</p>",
    "imgSpoiler": "img/1984_imgSpoil.png",
    "pubDate": "October 20, 2010",
    "projectLink": "http://andymalik.com/1984/html/index.html",
    "authors":[
      {
        "name": "Andy Malik",
        "link": "http://www.github.com/Ansem717"
      }
    ]
  },
  {
    "title": "Should immigrant children be banned from public schools?",
    "category": "School Work",
    "description": "<p>My second website. This one utilized a little bit Javascript on the functionality side, opposed to the 1984 project, using it simply for entertainment. Each internal link access the styles directly, as at the time I didn't know about jQuery. My friend Mahdi worked on the video, but it seems that the &lt;embed&gt; tag that I used for the video (which worked when I presented the project), doesn't seem to work now. Everything else works as intended.</p>",
    "imgSpoiler": "img/CWI_imgSpoil.png",
    "pubDate": "November 10, 2010",
    "projectLink": "http://andymalik.com/Immigration/111010/Real/index.html",
    "authors":[
      {
        "name": "Andy Malik",
        "link": "http://www.github.com/Ansem717"
      },
      {
        "name": "Mahdi Ramadan",
        "link": "https://www.facebook.com/mahdi.ramadan.9"
      }
    ]
  },
  {
    "title": "All about Hermes!",
    "category": "School Work",
    "description": "<p>This project was the first website I published which only had one html document, heavily utilizing similar Javascript from the Immigration website to show and hide many features. A simple table structured the content itself. I also implemented a small little quiz as well. This quick project only took one week to build, as the fade effect had many issues. I also did not check for cross-browser capability, so the fade effect may appear clunky.</p>",
    "imgSpoiler": "img/Hermes_imgSpoil.png",
    "pubDate": "November 20, 2010",
    "projectLink": "http://andymalik.com/hermes/index.html",
    "authors":[
      {
        "name": "Andy Malik",
        "link": "http://www.github.com/Ansem717"
      }
    ]
  },
  {
    "title": "Trapped!",
    "category": "Entertainment",
    "description": "<p>The biggest project I've ever done, and the first project I've ever made from scratch. This took up the entire summer, and I wasn't disappointed! My dad helped and supported me with the project, and I'm grateful for his help. He was essentially my instructor and code proof-reader. The goal of this project was to create a base world that I would have as a game and build off that, eventually making this game multiplayer, and giving me easy access to adding new quests, levels, monsters, etc. I wanted to create many different objects (as I was learning Object Oriented Programming) so I made completely uncessary arrays of objects. The code is not terribly pleasing to the eye, as my formatting was reliant on IE's inspect tool, and I didn't compare cross-browser. Dozens of variables have arbitrary names like n or nts and there is alot of clutter. The game, however, functions as intended. Commands to input in the text based game have shorthands like N or E for WALK NORTH or WALK EAST. The Up Arrow key performs similar actions as to a command terminal, re-typing the last line that was placed in. Two links, Game Log and Help, display pop-up windows of a log of everything that has occurred in game, as well as a help page incase youe stuck. I believe that if I was to follow through with another version of the game, it would have a lot less distractions for both the person playing the game, and the person using the code. Also, quick thanks to <a href=http://xat.com>Xat</a> for a neat chat feature! I hope you enjoy! ",
    "imgSpoiler": "img/Trapped_imgSpoil.png",
    "pubDate": "August 21, 2010",
    "projectLink": "http://andymalik.com/trapped/1.0/",
    "authors":[
      {
        "name": "Andy Malik",
        "link": "http://www.github.com/Ansem717"
      },
      {
        "name": "Nick Malik",
        "link": "https://www.linkedin.com/in/nickmalik"
      },
      {
        "name": "Chat by Xat",
        "link": "http://xat.com"
      }
    ]
  },
  {
    "title": "Who do you root for?",
    "category": "Entertainment",
    "description": "<p>Something very small and simple. I was messing around with multiple choices only being shown based on previous choices, as well as associating a value to show how your choices panned out. Something to throw together for fun on my own time.</p>",
    "imgSpoiler": "img/NFL_imgSpoil.png",
    "pubDate": "April 1, 2011",
    "projectLink": "http://andymalik.com/NFLTeam/index.html",
    "authors":[
      {
        "name": "Andy Malik",
        "link": "http://www.github.com/Ansem717"
      }
    ]
  },
  {
    "title": "Valve Fanbased Website",
    "category": "School Work",
    "description": "<p>This was a website I created in the spring of my junior year in high school. It was a web design class, so the content of the website didn't matter. The goal was to incorperate all we've learned in that class to make a fan-based website for any company we want. This was the Final for the class! The animations for the portal opening and closing are actual .gif images, not scripted effects. That is why the animations are clunky.</p>",
    "imgSpoiler": "img/Valve_imgSpoil.png",
    "pubDate": "June 1, 2012",
    "projectLink": "http://andymalik.com/valve/index.html",
    "authors":[
      {
        "name": "Andy Malik",
        "link": "http://www.github.com/Ansem717"
      }
    ]
  }
]
